from datetime import datetime as dt

import pytest


@pytest.fixture
def date():
    return dt.strptime("2018-07-11T02:26:18.671407", "%Y-%m-%dT%H:%M:%S.%f")


@pytest.fixture
def data():
    return [
        {
            "Дата операции": "17.07.2019 15:05:27",
            "Дата платежа": "19.07.2019",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": -25.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -25.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": "nan",
            "Категория": "Дом и ремонт",
            "MCC": 5200.0,
            "Описание": "OOO Nadezhda",
            "Бонусы (включая кэшбэк)": 0,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 25.0,
        },
        {
            "Дата операции": "23.01.2018 12:33:21",
            "Дата платежа": "23.01.2018",
            "Номер карты": "*4556",
            "Статус": "OK",
            "Сумма операции": -305.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -305.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": "nan",
            "Категория": "Переводы",
            "MCC": 6012.0,
            "Описание": "Перевод на карту",
            "Бонусы (включая кэшбэк)": 0,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 305.0,
        },
    ]


@pytest.fixture
def num_cards():
    return ["*7197", "*4556"]
